---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.CylindricalSurface
source: html/6d3492bd-3205-d936-5672-9f8be4ee97c1.htm
---
# CylindricalSurface Members

Construct a cylindrical surface defined by a local coordinate system and a radius.